{
  "irVersion": "1.0",
  "project": "mcp-confluence",
  "repository": "https://github.com/plexusone/mcp-confluence",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-05-24",
      "highlights": [
        { "description": "Composable omniskill architecture for modular, reusable MCP skills" },
        { "description": "Vault-backed credentials via omnitoken (1Password, Bitwarden, file, env)" },
        { "description": "Cobra CLI with subcommands and direct tool invocation" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/agentplexus/mcp-confluence` to `github.com/plexusone/mcp-confluence`", "commit": "0a3b89f" },
        { "description": "CLI now uses cobra with `--flag` style instead of `-flag`", "commit": "978eb21" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `agentplexus` to `plexusone`" },
        { "description": "Update CLI flag syntax from `-flag` to `--flag`" },
        { "description": "Update `go install` path to `github.com/plexusone/mcp-confluence/cmd/mcp-confluence@latest`" }
      ],
      "added": [
        { "description": "Composable Confluence skill using omniskill framework", "commit": "4cc2a3d" },
        { "description": "Cobra-based CLI with subcommands (serve, get-page, search-pages, etc.)", "commit": "978eb21" },
        { "description": "Vault-backed credentials via omnitoken (1Password, Bitwarden)", "commit": "978eb21" },
        { "description": "Direct CLI tool invocation for testing and scripting", "commit": "978eb21" },
        { "description": "API testing example in cmd/api-confluence", "commit": "fefaa60" },
        { "description": "Comprehensive MkDocs documentation site", "commit": "46d554b" }
      ],
      "changed": [
        { "description": "Module renamed from `agentplexus` to `plexusone` organization", "commit": "0a3b89f" },
        { "description": "Server now uses omniskill runtime instead of custom JSON-RPC handler", "commit": "978eb21" }
      ],
      "dependencies": [
        { "description": "Add `github.com/plexusone/omniskill` v0.8.0 for skill framework", "commit": "e91c665" },
        { "description": "Add `github.com/plexusone/omnitoken` v0.1.0 for credential management", "commit": "e91c665" },
        { "description": "Add `github.com/plexusone/omnivault-desktop` v0.1.0 for vault providers", "commit": "e91c665" },
        { "description": "Add `github.com/spf13/cobra` v1.10.2 for CLI framework", "commit": "e91c665" }
      ],
      "documentation": [
        { "description": "Add getting started guides (installation, setup, quickstart)", "commit": "46d554b" },
        { "description": "Add configuration documentation (credentials, environment, Claude Desktop)", "commit": "46d554b" },
        { "description": "Add storage format reference (overview, blocks)", "commit": "46d554b" },
        { "description": "Add tools reference documentation", "commit": "46d554b" },
        { "description": "Update README for vault-backed credentials and new module path", "commit": "9c84acd" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-29",
      "highlights": [
        { "description": "Initial release with MCP tools for safe Confluence page editing" },
        { "description": "Structured content blocks for creating and reading pages" },
        { "description": "Lossless XHTML round-trip editing for complex pages" }
      ],
      "added": [
        { "description": "`confluence_read_page` tool for reading pages as structured content blocks" },
        { "description": "`confluence_read_page_xhtml` tool for reading pages as raw Storage Format XHTML" },
        { "description": "`confluence_update_page` tool for updating pages with structured content blocks" },
        { "description": "`confluence_update_page_xhtml` tool for updating pages with raw XHTML" },
        { "description": "`confluence_create_page` tool for creating new pages with structured blocks" },
        { "description": "`confluence_create_table` tool for creating table blocks from structured data" },
        { "description": "`confluence_delete_page` tool for deleting pages by ID" },
        { "description": "`confluence_search_pages` tool for searching pages using CQL" },
        { "description": "Structured block types: Paragraph, Heading, Table, BulletList, NumberedList, Macro, CodeBlock, HorizontalRule" },
        { "description": "Storage package with Parse, Render, and Validate functions" },
        { "description": "HTML entity support for Storage Format XHTML" },
        { "description": "Confluence REST API client with basic authentication" }
      ]
    }
  ]
}
